backend/src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://bookingxml.com/soap-example">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getUserRequest>
            <us:name>dejan</us:name>
        </us:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>